---
kind: other
id: Methods.T:Autodesk.Revit.DB.Electrical.CableTrayConduitBase
source: html/6b3981ed-559a-a8b2-cd2a-82c1383d9627.htm
---
# CableTrayConduitBase Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.